//************************************************
//*******ПЕРЕМЕННЫЕ*******************************
//************************************************
//Длина загружаемого леса
var Len = 0;
//Номер бревна попорядку
var N = 0;
//Диаметр бревна
var D = 0;
//Объем бревна заданного диаметра
var V = 0;
//Общий объем загруженных бревен
var totalV = 0;
//Максимальный объем
var maxV = 36600;
$('#max-val').val(3600);
//Осталось загрузить
var restVal = 0;
$('#max-val-rest').val(0);
//Общий массив загрузки
var Partia = [];
//Массивы соответствий D:V для разных длин
var L_3_8 = [];
var L_5_8 = [];


L_3_8 = {
    "14":68,
    "16":90,
    "18":113,
    "20":139,
    "22":170,
    "24":200
};

L_5_8 = {
    "14":118,
    "16":149,
    "18":186,
    "20":220,
    "22":270,
    "24":320
};


//************************************************
//*******ФУНКЦИИ**********************************
//************************************************

//Вывод всех параметров
function showParam(){
    console.log (
        'Len = ' + Len + '\n' +
        'N = ' + N  + '\n' +
        'D = ' + D + '\n' +
        'V = ' + V + '\n' +
        'totalV = ' + totalV  + '\n'
    );
}

//Показ сообщений
function errorMessages(message){
    $('.error').text(message).fadeIn().delay(2000).fadeOut();
}

//************************************************
//*******ПРОГРАММА********************************
//************************************************

//Выбор длины загружаемого леса
$('.choose-len-btn').click(function(){
    $('.fa-check').css('opacity','0');
    $(this).prev('i').css('opacity','1');
    Len = $(this).attr('len');

    //Обнуление диаметра и объема для ввода с новой длиной
    $('#diam').val('');
    $('#val').val('');
    D = 0;
    V = 0;

    showParam();
});

//Ввод диаметра следующего бревна
$('#diam').keyup(function(){

    var temp_diam = $(this).val();
    //Пропускаем только четные значения
    if( !(temp_diam%2) )
    {
        D = $(this).val();
        //Расчет объема текущего бревна
        switch (Len)
        {
            case '38':
                V = L_3_8[D];
                break;
            case '58':
                V = L_5_8[D];
                break;
        }

        //Выводим объем текущего бревна
        if(V)
        {
            $('#val').val(V+'cм3');
        }
        else if(D < 0 || D > 9)
        {
            errorMessages('НЕТ ДАННЫХ ДЛЯ ДИАМЕТРА');
        }
    }


    showParam();

});

//Ввод данных следующего бревна
$('#enter-diam').click(function(){
    //при пустом диаметре не срабатывает
    if(D >= 12 && Len > 0 && typeof V != "undefined")
    {
        N++;
        $('.num').text('№ ' + N );

        //Расчет общего объема
        totalV += V;
        $('#total_val').val(totalV + ' cм3');

        //Печать таблицы результатов
        $('.table-res').append(
            '<tr>'+
            '<td>'+N+'</td>'+
            '<td>'+Len+'</td>'+
            '<td>'+D+'</td>'+
            '<td>'+V+'</td>'+
            '<td>'+totalV+'</td>'+
            '<td><i class="fa fa-minus-square del"></i></td>'+
            '</tr>'
            );


        //Осталось загрузить
        maxV = $('#max-val').val();
        restVal = maxV - totalV;
        $('#max-val-rest').val(restVal);


        //Обнуление диаметра и объема для следующего ввода
        $('#diam').val('');
        $('#val').val('');
        D = 0;
        V = 0;
    }
    else
    {
        D = 0;
        V = 0;

        if(Len == 0)
            errorMessages('НЕ ВЫБРАНА ДЛИНА');
        else
            errorMessages('НЕПРАВИЛЬНЫЙ ДИАМЕТР');
    }


    showParam();

});

//************************************************
//*******РАЗНОЕ***********************************
//************************************************

