<?php
session_start();
// запрет прямого обращения
define('LES', TRUE);
//session_destroy();
//unset ($_SESSION);

require_once 'config.php';
require_once FUNCTIONS;
require_once MODEL;
//**********************************************************************************************************************
//НАЧАЛО СОХРАНЕНИЕ ЗАГРУЗКИ КОНТЕЙНЕРА В БД
if($_POST['save_loading'] == 'yes')
{
    //$_SESSION = $_POST['DATA'];
    $LOADING = [];
    $LOADING = $_POST['DATA'];
    saveLoading($LOADING);


    //ответ с сервера на ajax запрос
    sendRespons();
}//КОНЕЦ СОХРАНЕНИЕ ЗАГРУЗКИ КОНТЕЙНЕРА В БД
//**********************************************************************************************************************
//НАЧАЛО ПОЛУЧЕНИЕ ВСЕХ ЗАГРУЖЕННЫХ КОНТЕЙНЕРОВ ИЗ БД
$_SESSION['all_loadings'] = getAllLoadings();

//if($_POST['all_loadings'] == 'yes')
//{
//    $_SESSION['all_loadings'] = getAllLoadings();
//
//}//КОНЕЦ ПОЛУЧЕНИЕ ВСЕХ ЗАГРУЖЕННЫХ КОНТЕЙНЕРОВ ИЗ БД
//**********************************************************************************************************************
//НАЧАЛО ПОЛУЧЕНИЕ СЕГОДНЯШНИХ ЗАГРУЖЕННЫХ КОНТЕЙНЕРОВ ИЗ БД
if($_POST['current_loadings'] == 'yes')
{
    $_SESSION['current_loadings'] = getCurrentLoadings();

}//КОНЕЦ ПОЛУЧЕНИЕ СЕГОДНЯШНИХ ЗАГРУЖЕННЫХ КОНТЕЙНЕРОВ ИЗ БД
//**********************************************************************************************************************
//НАЧАЛО ПОЛУЧЕНИЕ ОДНОГО КОНТЕЙНЕРА ПО id
if($_GET['one_loading'] == 'yes')
{
    $id = (int)$_GET['id'];
    $_SESSION['one_loading'] = getOneLoading($id);
    //ответ с сервера на ajax запрос
    sendRespons();
}//КОНЕЦ ПОЛУЧЕНИЕ ОДНОГО КОНТЕЙНЕРА ПО id
//**********************************************************************************************************************

////тестовая выборка
//$_SESSION['current_loadings'] = getCurrentLoadings();
//$_SESSION['all_loadings'] = getAllLoadings();
//$id = 18;
//$_SESSION['one_loading'] = getOneLoading($id);
/* закрытие соединения */
$mysqli->close();

