<?php
session_start();
// запрет прямого обращения
define('LES', TRUE);
//session_destroy();
//unset ($_SESSION);

require_once 'config.php';
require_once FUNCTIONS;
require_once MODEL;
//**********************************************************************************************************************
//НАЧАЛО СОХРАНЕНИЕ ЗАГРУЗКИ КОНТЕЙНЕРА В БД
if($_POST['save_loading'] == 'yes')
{
    //$_SESSION = $_POST['DATA'];
    $LOADING = [];
    $LOADING = $_POST['DATA'];
    saveLoading($LOADING);


    //ответ с сервера на ajax запрос
    sendRespons();
}//КОНЕЦ СОХРАНЕНИЕ ЗАГРУЗКИ КОНТЕЙНЕРА В БД
//**********************************************************************************************************************
//НАЧАЛО ПОЛУЧЕНИЕ ЗАГРУЖЕННЫХ КОНТЕЙНЕРОВ ИЗ БД
if($_POST['current_loadings'] == 'yes')
{
    $_SESSION['current_loadings'] = getCurrentLoadings();

}//КОНЕЦ ПОЛУЧЕНИЕ ЗАГРУЖЕННЫХ КОНТЕЙНЕРОВ ИЗ БД
//**********************************************************************************************************************
//НАЧАЛО ПОЛУЧЕНИЕ ОДНОГО КОНТЕЙНЕРА ПО id
if($_POST['one_loading'] == 'yes')
{
    $id = (int)$_POST['id'];
    $_SESSION['one_loading'] = getOneLoading($id);

}//КОНЕЦ ПОЛУЧЕНИЕ ОДНОГО КОНТЕЙНЕРА ПО id
//**********************************************************************************************************************

//тестовая выборка
$_SESSION['current_loadings'] = getCurrentLoadings();
$id = 18;
$_SESSION['one_loading'] = getOneLoading($id);
/* закрытие соединения */
$mysqli->close();

